# St7GetPropertyColour

Returns the colour assigned to the specified property.

long St7GetPropertyColour(long uID, long Entity, long PropNum, long* PropCol)

Input Parameters

uID

Strand7 model file ID.

Entity

One of ptBEAMPROP, ptPLATEPROP, ptBRICKPROP or ptPLYPROP.

PropNum

Property number.

Output Parameters

PropCol

Property colour. See also RGB Colours.